{
  "backend/main.mo": "Motoko canister implementing user profiles, courses, lessons, trainee progress, and admin-restricted content management with AccessControl and blob storage mixins.",
  "feature_evidence.json": "JSON report linking product features to corresponding source files, components, and test IDs for project traceability.",
  "frontend-file-summaries.txt": "Prewritten mapping of frontend file paths to short summaries describing their purpose and functionality.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying global styles.",
  "frontend/index.html": "Basic HTML shell mounting the React application and loading the main entry script.",
  "frontend/src/App.tsx": "Main React router configuration defining public and admin routes, layout, and theming for the application.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Component that checks admin status and blocks access with an error screen when the caller lacks privileges.",
  "frontend/src/components/auth/LoginButton.tsx": "Auth button handling Internet Identity login/logout with state feedback and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal forcing first-time users to submit name and optional email before accessing the app.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, navigation, mobile menu, authentication state, and footer wrapper.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-related queries and mutations including admin checks and PDF import functionality.",
  "frontend/src/hooks/useAdminContent.ts": "Provides admin CRUD hooks for courses, lessons, and content status with automatic query invalidation.",
  "frontend/src/hooks/useCourses.ts": "Exposes public course and lesson retrieval hooks using the actor for fetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication state, login/logout handling, and context provider.",
  "frontend/src/hooks/useKnowledgeBase.ts": "Fetches all lessons or a single lesson for the knowledge base by aggregating lessons across courses.",
  "frontend/src/hooks/useProgress.ts": "Handles trainee progress fetching and mutations for completing lessons or enrolling in courses.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and update the current user's profile with proper loading state handling.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining theme colors and global styling.",
  "frontend/src/main.tsx": "Application entry point setting up React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with information about AAA Lawyers’ training focus, mission, and course topics using cards and structured sections.",
  "frontend/src/pages/admin/AdminCoursesPage.tsx": "Implements the admin interface for creating, editing, and managing courses, including dialogs, forms, and status updates.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows the admin dashboard with navigation cards for PDF import, course management, and lesson management.",
  "frontend/src/pages/admin/AdminLessonsPage.tsx": "Provides an admin interface for creating, editing, and managing lessons with form dialogs and status controls.",
  "frontend/src/pages/admin/AdminPdfIngestPage.tsx": "Provides an admin interface to upload a PDF, trigger import via mutation, and optionally paste extracted text.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details and training support info with cards for phone, email, location, and office hours.",
  "frontend/src/pages/courses/CourseDetailPage.tsx": "Displays course details, enrollment actions, and user progress with published lessons.",
  "frontend/src/pages/courses/CoursesIndexPage.tsx": "Lists all published courses with loading states and navigation to individual course pages.",
  "frontend/src/pages/courses/LessonPage.tsx": "Shows a lesson's content, completion tracking, and navigation to adjacent published lessons.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage layout with hero section, training overview, and feature cards linking to courses and the knowledge base.",
  "frontend/src/pages/knowledge-base/ArticleDetailPage.tsx": "Displays a knowledge‑base article’s title and content with loading and not‑found handling.",
  "frontend/src/pages/knowledge-base/KnowledgeBaseIndexPage.tsx": "Lists published knowledge‑base articles with category filters and loading states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Defines overall project state including scope, features, requirements, and image needs for the AAA Lawyers training site."
}